module.exports = [
    
    "1. 作業缺交情境: 小華最近一個月內經常未按時繳交作業，老師多次提醒和鼓勵他，但情況依舊沒有改善，甚至繳交的作業量越來越少。因此老師希望與家長溝通，了解是否有家庭因素影響他的學習習慣，並一起協助他養成規律完成作業的習慣。",
    "2. 說謊情境: 小美在學校經常對老師和同學撒謊，例如她謊稱已完成作業或否認與同學的爭執。老師曾多次單獨與小美談話，強調誠實的重要性，試圖導正小美的偏差行為，但效果不佳。老師希望與家長聯繫，了解小美是否在家中也有類似行為，並共同協助她改變說謊習慣。",
    "3. 偷竊情境: 小明在學校發生了多次未經同學同意擅自拿取同學文具或搶同學零食的事件。直到被其他親眼目睹同學向老師告發小明才願意承認。老師已經與他討論過這些行為的不當性與老師的擔憂，但小明仍然沒有改變。因此決定與家長聯繫，了解小明的行為背後是否有家庭或心理方面的問題。",
    "4. 同學衝突情境: 小東在學校因情緒控管不佳，較以自我為中心的個性，已多次與同學發生肢體衝突，以動手當作處理問題的方式，每次衝突後，老師都與他談過並試圖教導他如何解決人際矛盾，但他仍然難以控制自己的情緒。老師擔心衝突會影響小東的同學關係，決定與家長討論，看看能否找到更有效的策略來幫助小東學會更好的衝突解決方式。",
    "5. 言語霸凌情境: 小婷經常用侮辱性語言欺負同學，特別針對一些比較內向的學生。老師已經幾次提醒小婷，也通過班級活動討論過尊重他人的重要性，但小婷的態度並沒有顯著改變。老師擔心這樣的行為會對受害同學造成長期影響，因此決定與家長聯繫，共同尋求解決方案。",
    "6. 性別身體界線情境: 小宏多次在學校不當觸碰異性同學，造成同學的不舒服，老師已經多次提醒他並與他談話，強調尊重他人身體界線的重要性。但小宏依然以此為惡作劇的方式，偶爾會重複類似行為。老師決定與家長聯繫，希望家長能夠從家庭中給予更多輔導。",
    "7. 生活常規情境: 小涵經過申請帶手機到學校，依規定放學後才能將手機拿出來聯繫使用。但小涵經常在課堂上偷偷使用手機，老師多次提醒，並暫時保管手機，放學歸還，但她依然沒有改變這一行為。老師發現小涵在課堂上的專注度越來越低、精神狀況不佳，學習成績也受到影響，因此決定與家長聯繫，了解是否能夠改善這一情況。",
    "8. 上課遲到情境: 小強連續多週每天都遲到，老師已經幾次提醒他提早準備，但小強表示是媽媽爬不起來，又不肯讓他自己去上學。但老師透過與同學側面的了解，小強經常半夜1、2點還在打遊戲，因此老師想要了解真實的狀況，以及與家長討論溝通，探討如何幫助小強改變遲到習慣。",
    "9. 講髒話情境: 小凡經常在課堂上或課間對同學講髒話，老師已經多次對他進行教育，但小凡的言語習慣依然沒有顯著改善，常常嚷嚷著我爸爸也都會說阿。老師擔心這樣的行為會對其他同學產生負面影響，於是決定與家長討論如何更有效地引導小凡改善言語習慣。",
    "10. 傳清涼照片情境: 小芸最近在班級群組裡傳了一些不適合年齡的清涼照片，老師已經多次警告她不應該在網絡上傳播這些內容，並且與她討論了網絡安全和尊重他人的重要性。然而，小芸的行為沒有改變，老師決定與家長聯繫，希望能夠在家庭中進行更多的網絡使用教育。",
    "11. 在群組公開批評同學情境: 小雄在班級LINE群組裡公開批評同學，使用了一些貶低的語言，例如下賤、低能等。老師已經與他談話，解釋這樣的行為會對他人的情感造成傷害，並進行了法治教育，但小雄並未改善。老師擔心這樣的行為會持續對班級氣氛造成影響，於是決定與家長聯繫，共同尋求改善方案。",
    "12. 上課分心情境: 小雪經常在課堂上分心，老師曾經試過調整座位、走動到她面前、邀請回答問題等方式，但她在課堂上的注意力仍然無法集中。老師感覺這樣的情況已經影響到她的學習進度，因此決定與家長溝通，了解是否在家中也有類似情況，並一起找出解決方案。",
    "13. 威脅同學情境: 小勇經常向同學借錢，威脅同學若不借錢，就要鼓動其他同學不跟他玩，且借錢也沒有還過。老師已經慎重私下與小勇教導這樣的行為涉及法律問題，並在班上適時地進行法治教育，但小勇的行為並未有所改善。老師決定與家長聯繫，了解是否在家中也有相關情況。",
    "15. 課堂講話干擾情境: 小瑋經常在課堂上與隔壁同學講話，干擾其他同學的學習，老師多次提醒他保持安靜，並試圖通過座位調整來改善，但問題依舊存在。老師感到無法有效解決此問題，決定與家長聯繫，希望家長能提供更多幫助。",
    "16. 私自翻動他人物品情境: 某天老師回到教室時，發現桌上的資料夾被翻過，裡面的評分表掉在地上。老師調查後，發現是小俊趁下課時打開抽屜，好奇地翻看老師的私人物品。當老師詢問他為什麼要這麼做時，小俊笑著說：「我只是想看看老師平常都在做什麼。」其他同學也抱怨：「他之前還翻過我們的鉛筆盒！」老師擔心這樣的行為侵犯隱私，並且與他人相處也產生衝突，因此決定聯繫家長，希望能提供更多幫助。",
    "17. 在考試中作弊情境: 數學小考時，小安用課本墊在桌下假裝專心答題，實則趁老師不注意時偷偷翻閱答案。其他同學反映，小安考試前曾在群組裡說：「這次考試超難，但我有方法搞定！」當老師發現作弊並沒收考卷時，小安當場大喊：「不就看一下而已，有必要這麼嚴重嗎？」考試結束後，他還在班上散佈：「老師超愛針對我！」老師針對此項行為與小安溝通過程，發現小安很在意成績，但無法認知到自己的作法錯誤，決定與家長聯繫，希望從家長處了解小安",
    "18. 情緒困擾或壓力過大:小芸最近在課堂上經常發呆，有時甚至突然哭泣，但當老師關心時，她總是說：「沒事，不要問。」、「沉默拒絕表達」同學們反映她常一個人坐在角落，不願與人互動。導師擔心她可能遭遇家庭或同儕問題，但無法確定原因，因此想聯繫父母親確認孩子在家中的狀況，適度的提供小芸協助。"


];